app/controllers/aerolineas_controller.rb

  def index
    @aerolineas = Aerolinea.all
---
SELECT "aerolineas".* FROM "aerolineas"

  def create
    @aerolinea = Aerolinea.new(aerolinea_params)

    respond_to do |format|
      if @aerolinea.save
---
INSERT INTO "aerolineas" ("created_at", "direccion", "nombre", "telefono", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-10-31 23:46:52.218000"], ["direccion", "americo vespucio 2547"], ["nombre", "lan"], ["telefono", "257871852"], ["updated_at", "2015-10-31 23:46:52.218000"]]

    def set_aerolinea
      @aerolinea = Aerolinea.find(params[:id])
---
SELECT  "aerolineas".* FROM "aerolineas"  WHERE "aerolineas"."id" = ? LIMIT 1  [["id", 1]]