app/controllers/clases_controller.rb

  def index
    @clases = Clase.all
---
SELECT "clases".* FROM "clases"

  def create
    @clase = Clase.new(clase_params)

    respond_to do |format|
      if @clase.save
---
INSERT INTO "clases" ("created_at", "t_clase", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-11-01 02:16:10.749000"], ["t_clase", "economica"], ["updated_at", "2015-11-01 02:16:10.749000"]]

    def set_clase
      @clase = Clase.find(params[:id])
---
SELECT  "clases".* FROM "clases"  WHERE "clases"."id" = ? LIMIT 1  [["id", 1]]