app/controllers/cliente_vuelos_controller.rb

SELECT "cliente_vuelos".* FROM "cliente_vuelos"
---
  def index
    @cliente_vuelos = ClienteVuelo.all

INSERT INTO "cliente_vuelos" ("cliente_id", "created_at", "updated_at", "vuelo_id") VALUES (?, ?, ?, ?)  [["cliente_id", 1], ["created_at", "2015-11-01 02:32:57.590000"], ["updated_at", "2015-11-01 02:32:57.590000"], ["vuelo_id", 1]]
---
  def create
    @cliente_vuelo = ClienteVuelo.new(cliente_vuelo_params)

    respond_to do |format|
      if @cliente_vuelo.save

DELETE FROM "cliente_vuelos" WHERE "cliente_vuelos"."id" = ?  [["id", 2]]
---
  def destroy
    @cliente_vuelo.destroy

SELECT  "cliente_vuelos".* FROM "cliente_vuelos"  WHERE "cliente_vuelos"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "vuelos".* FROM "vuelos"  WHERE "vuelos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_cliente_vuelo
      @cliente_vuelo = ClienteVuelo.find(params[:id])