app/controllers/clientes_controller.rb

SELECT "vuelos".* FROM "vuelos" INNER JOIN "cliente_vuelos" ON "vuelos"."id" = "cliente_vuelos"."vuelo_id" WHERE "cliente_vuelos"."cliente_id" = ?  [["cliente_id", 2]]
---
  def show
    @vuelos =   @cliente.vuelo.all

INSERT INTO "clientes" ("apellidos", "created_at", "email", "nombre", "rut", "telefono", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save