app/controllers/destinos_controller.rb

  def index
    @destinos = Destino.all
---
SELECT "destinos".* FROM "destinos"

  def create
    @destino = Destino.new(destino_params)

    respond_to do |format|
      if @destino.save
---
INSERT INTO "destinos" ("ciudad", "created_at", "n_aeropuerto", "updated_at") VALUES (?, ?, ?, ?)  [["ciudad", "Antofagasta"], ["created_at", "2015-10-31 23:47:45.671000"], ["n_aeropuerto", "aeropuerto cerro moreno"], ["updated_at", "2015-10-31 23:47:45.671000"]]

    def set_destino
      @destino = Destino.find(params[:id])
---
SELECT  "destinos".* FROM "destinos"  WHERE "destinos"."id" = ? LIMIT 1  [["id", 2]]