app/controllers/itinerarios_controller.rb

SELECT "itinerarios".* FROM "itinerarios"
---
  def index
    @itinerarios = Itinerario.all

INSERT INTO "itinerarios" ("codigo_it", "created_at", "destino_id", "fecha", "hora", "origen_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @itinerario = Itinerario.new(itinerario_params)

    respond_to do |format|
      if @itinerario.save

SELECT  "itinerarios".* FROM "itinerarios"  WHERE "itinerarios"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_itinerario
      @itinerario = Itinerario.find(params[:id])