app/controllers/origens_controller.rb

  def index
    @origens = Origen.all
---
SELECT "origens".* FROM "origens"

  def create
    @origen = Origen.new(origen_params)

    respond_to do |format|
      if @origen.save
---
INSERT INTO "origens" ("ciudad", "created_at", "n_aeropuerto", "updated_at") VALUES (?, ?, ?, ?)  [["ciudad", "santiago"], ["created_at", "2015-10-31 23:47:24.779000"], ["n_aeropuerto", "Aeropuerto internacional arturo benitez"], ["updated_at", "2015-10-31 23:47:24.779000"]]

    def set_origen
      @origen = Origen.find(params[:id])
---
SELECT  "origens".* FROM "origens"  WHERE "origens"."id" = ? LIMIT 1  [["id", 1]]