app/controllers/pasajes_controller.rb

  def index
    @pasajes = Pasaje.all
---
SELECT "pasajes".* FROM "pasajes"

  def create
    @pasaje = Pasaje.new(pasaje_params)

    respond_to do |format|
      if @pasaje.save
---
INSERT INTO "pasajes" ("asiento", "clase_id", "cliente_id", "created_at", "updated_at", "valor", "vuelo_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["asiento", "17b"], ["clase_id", 1], ["cliente_id", 1], ["created_at", "2015-11-01 02:19:18.602000"], ["updated_at", "2015-11-01 02:19:18.602000"], ["valor", "125.000"], ["vuelo_id", 1]]

    def set_pasaje
      @pasaje = Pasaje.find(params[:id])
---
SELECT  "pasajes".* FROM "pasajes"  WHERE "pasajes"."id" = ? LIMIT 1  [["id", 1]]