app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)
    @usuario.save
---
INSERT INTO "usuarios" ("cliente_id", "created_at", "password", "updated_at") VALUES (?, ?, ?, ?)  [["cliente_id", 24182099], ["created_at", "2015-11-01 23:46:15.048000"], ["password", "duverhrta"], ["updated_at", "2015-11-01 23:46:15.048000"]]

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = 4  ORDER BY "usuarios"."id" ASC LIMIT 1