app/controllers/vuelos_controller.rb

SELECT "vuelos".* FROM "vuelos"
---
  def index
    @vuelos = Vuelo.all

INSERT INTO "vuelos" ("aerolinea_id", "capacidad", "created_at", "itinerario_id", "modelo_avion", "num_vuelo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @vuelo = Vuelo.new(vuelo_params)

    respond_to do |format|
      if @vuelo.save

SELECT  "vuelos".* FROM "vuelos"  WHERE "vuelos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_vuelo
      @vuelo = Vuelo.find(params[:id])